package com.example.jokingApp.bean;

/**
 * Created by idea-pc on 2016/5/11.
 */
public class TerrorDeatail {


    /**
     * showapi_res_code : 0
     * showapi_res_error :
     * showapi_res_body : {"allPages":1,"ret_code":0,"text":"
     * 堕州有一个戏班，盘踞在汝南。一直以来，班主龙贵华在闽中贵为芗戏王之称，只可惜闽戏遭到地方府衙的打压。后来，在堕州，就出现了挂名 倪家玉的戏班，班主仍是龙贵华，走的路子不再是闽戏的秀外慧中，而是融入了堕州风情的地方戏种。
     * 龙贵华有个女儿，叫香香，眉心上方有粒红痣，与挂图中的观世音菩萨极其相似。因这个缘故，戏班子里逢有仙戏，观音的扮角定是香香。戏班子曾经在堕州总兵汤险安的府上演过一出戏，戏名叫
     * 《观音收童子》，这是在堕州一带流传甚广的传说。谢幕戏上，香香扮的观音踩上莲花座，莲花座悬空浮起，观音手扶绿柳瓶，目光和祥，座下莲花花瓣徐徐展开，祥光四射。童子穿红妆，扎小辫，腾着浮云也飘向空中，戏场烟雾弥漫。汤总兵的老母亲看了这出戏后，还耸在戏端下不来，她对汤险安说，那尊观音真神了，跟她梦里的观音菩萨一模一样。言下之意，是要汤险安多赏银子犒劳戏班子。不久，汤险安的母亲病逝，汤总兵在堕州西郊山陵造了座豪华陵墓。头七那天，汤险安请来了班主龙贵华，要戏班在西郊山陵其母坟前搭台唱戏。龙贵华很生气，他认为戏班子从没有在坟前为死人演过戏，戏是演给活人看的，演给死人看的那不叫阴戏了？    汤险安笑道：班主该改口了，这不叫阴戏，叫仙戏。龙贵华拂袖而去，不欢而散。    这算是与汤总兵结下了怨。    这一年，堕州一带一年没下半滴雨，农作物颗粒无收，百姓处在恐慌之中。当朝皇帝南下游玩正好路过此处，见百木枯零，田野荒废。    皇帝指着饥荒的堕州大地问汤总兵：这满目荒凉，让朕的心胆寒呀！    随行的一名叫达达苏的蕃僧，替汤险安开解，对皇帝说：贵国民间素有龙王显灵一说，今天下太平，惟独龙王不行云布雨，定是那龙王酣睡不醒，休眠在这波平浪静的堕州河。皇帝听了蕃僧的一席话，并不放在心上，汤险安却如捉住了救命稻草。    当晚，皇帝睡至半夜，迷迷糊糊听到有人在召唤他，便合衣坐了起来，他看见芸窗兀自开了，窗前飘来一朵祥云，祥云中立着个人，分明是一尊身穿白衣的观世音菩萨，手提杨柳枝，丹唇轻启：今堕州大旱，原因在这堕州黎民中，有个名叫香香的女子竟然假扮本座，时常扰乱龙王视听，龙王怪罪下来，禁闭了雨期。今本座手上有张图，便是香香姑娘，惟有用她举行祭雨仪式，方能开禁雨期，重降甘露！说完，把手上的卷图抛进窗内，祥云各自散去。皇帝伸手去捉，果然接住一个物件，这一捉，蓦地清醒，见拿在手上的却不是什么图，而是自己腰间的一个鲤鱼坠。    隔日，皇帝将这一梦境公布，向蕃僧讨个解释。蕃僧转过身对汤险安道：皇上此梦做得及时，不然，堕州百姓岌岌可危也。当下务必要依皇上梦境行事，用那个名叫香香的女子行祭雨仪式。随后蕃僧又对皇帝讲道：既然皇上的鲤鱼坠在梦境中变为香香姑娘的画图，请皇上把玉坠交与汤总兵，以用于祭雨仪式用！    皇帝头脑一发蒙，就解下腰间的一枚鲤鱼坠来，交于汤险安，嘱咐道：切不可劳命伤财！袖管一拂，便离开了堕州。    原来，汤险安用财宝贿赂蕃僧，让其作法，促使皇帝得梦，便是要治龙贵华的辞戏之祸。    汤险安立马派人去捉龙贵华的女儿香香。戏班子当时正在汝南集圩拆解戏棚，不料一队人马包围住了戏棚。    汤总兵喝道：皇上有旨，选用民间女子香香，行祭雨仪式。来人，把她给我捉走！    荒唐呀，荒唐！龙贵华拦在官兵面前。官兵一拥而上，把龙贵华推搡开来，捉走了香香。鬼故事大全：guidaye.com    戏班子的人看着班主的女儿被捉走，有一种树倒猢狲散的悲哀感，又逢这旱灾，人都吃不饱，谁还有心思看戏，便三三两两地卷起包裹逃命去了。龙贵华看着眼前这一切，昏死过去。    堕州河边，祭雨师开坛祭雨。官兵押解着将被献给堕河龙王的香香，香香胸前挂着那枚鲤鱼坠。    堕州百姓虽不满拿香香来行祭雨仪式，但一想到如若真能求来雨露，他们的良心就蔫了，全都木然地看着这场祭雨仪式。汤总兵让一队官兵排成一堵刀墙，以防止不良百姓搅了仪式。    祭雨师把几道符用桃木剑挑了，焚烧后便扬扬手。    随着官兵一推，香香沉入堕州河，水面上并未起波澜。    堕州河底，有一对朱家兄弟，正在水底潜水挖蚌。突见河面上沉下一物来，待兄弟俩看清，原来是一个好看的姑娘，身上绑一块巨大的雨花石。哥哥朱大赶紧用腰间的刀划开绑在石上的绳索，弟弟朱二在前引路，一前一后，在水底把姑娘偷偷给救出。    求雨仪式后，堕州并未见下半滴雨来。祭雨师被千夫所指，慌乱之下，祭雨师口口声声说：定是有人坏了求雨秘咒，供奉龙王的女子，必出了差错。于是汤总兵命人下河捞人，果然只寻到一块雨花石。    风声四起，百姓也跟着附合，都道：这下坏了，天谴了。    朱大听到了堕州�面上的诸多传闻，香香自然不能再在堕州出现，便用一种鱼膘做成的面胶，覆在香香的脸上。没过几天，那鱼膘胶就成了一张人皮膜，把香香的容貌改变了。    香香感于朱大朱二的救命之恩，因担心露面会害了朱大朱二及连累父亲龙贵华，便断了去意，安心住在朱家。不久，与朱大日久生情，便嫁与朱大。朱二表面上没说什么，内心却堵得慌，其实他也恋上了香香。朱二不久便搬离了朱家，且不再与朱大一起下河挖蚌捕鱼，各干各的，兄弟情分日渐生离。    这天，香香补鱼网，突然针扎到了拇指上，拇指渗出了血珠子。有一滴被香香无意中沾到了腰间挂的鲤鱼坠上。倾刻间，香香感到腰间晃动，似有什么东西在争个鱼死网破似的，忙伸手去摸腰间，手上却并无它物，只是腰间的鲤鱼坠热得烫手。    香香预感到出了事，一定是朱大。便赶紧跑去赌坊，喊出朱二。原来朱二搬离朱家后，便沉迷赌场。算朱二还有点良心，速去堕州河，在朱大平日下水的地方，潜入河中，果然见朱大沉在堕河底。    朱二费了九牛二虎之力，才把朱大拖上岸。幸好朱大练过闭气功，捡回一条命。    这天，赌坊来了一个大佬，赌技奇淫之术，练得是炉火纯青。坐镇赌坊后，横扫一片本地赌徒。朱二也着了大佬的道，与大佬赌了三盘后，朱二输光了家底，且欠了一大笔赌债。    大佬带了几个帮手，按住朱二，要朱二偿还赌债。朱二人穷志短，扑通跪地，求大佬宽限几日，几日之后，必有不义之财。    朱二出了赌坊，便潜入朱家，把香香藏挂在腰间的鲤鱼坠扯在手上，跑远了。鬼dàyé    朱大回来听说后，骂道：朱二怕是穷途末路，抢去典当了。香香却摇头道：若是去典当了还好，只怕去那恶贼的府上，告发你坏了官府的求雨！香香话一出口，朱大顿时愣在那里，赌棍什么事干不出来？香香说得没错，朱二出了门，便跑到了汤总兵的府上。看门的兵丁见朱二不像善种，拦住去路。    朱二说有天大的秘密献上。汤总兵传朱二进见：听说你有天大的秘密，普天之下，跟天有关的，除非圣上。你一个小小的平民百姓，能有多大的屁事！    大人，若小的讲出的秘密有价值，求大人赏小的一笔赏钱。    汤总兵点了下头，朱二便把朱大救走香香一事，添油加醋说了出来，只是略过了自己也参与其中。可怪的是，朱二找遍了身上，也不见鲤鱼坠踪影，好在汤总兵没让他拿出证物。    汤总兵并不信祭雨，只是为了报复龙贵华，看来他的女儿香香是被救了。    汤总兵一声令下：速去把朱大和香香。缉拿归案。众兵丁领命而去。朱二眼巴巴地等着赏钱，汤总兵却让兵丁把朱二轰出去。汤府内有一个大池子，水气氤氲，朱二多看了几眼，冷不防，背后被兵丁一推，掉入池子。兵丁只是嫌朱二走得慢，推了一把，想不到把朱二推入了池子。    朱二落水后，才知池子好深。怪的是，朱二被一股力量推往池底，池底有个暗道，朱二顺着暗道游去，没多久，游到了天方地阔的堕州河，原来暗道贯通堕州河和总兵府。水能聚财，汤总兵是听信了风水大师的话，才花大力气秘密挖通了此水道。    想不到这时，河面上漂着一条船，船上有个老者，正在钓鱼。朱二借机爬上船，老者见朱二腰间挂着玉坠，吃了一惊，伸手让朱二摘下。朱二也很奇怪，在总兵府上，苦寻不到玉坠，玉坠何以就一直戴在腰间呢？朱二解下玉坠，老者摸着这块玉坠道：这乃是圣上之物，为何在你手中？老者自称前朝国师，只因当今圣上偏信蕃僧蛊乱，这才远离朝都，漂泊于此。他知道这枚鲤鱼坠的出处，便讲予朱二：    很久以前，凡物若想要修练成人的样子，而又不想苦修上百年的话，有一个捷径可走，那就是到观音庙去，变成一对占卜哭笑钵，尽让人去摔打，换取功德。果真有这么一条鲤鱼，它来到观音面前，虔诚地央求观音把它的躯体变为哭笑钵。观音笑着对它讲，世间万物若想索取，必要赌风险，若你变不成人样，只能永生做一块石头，你甘愿吗？那红鲤没有意见，观音就真的把它变为一对哭笑钵。做了一对哭笑钵，由此它听遍了来参拜观音的人的话，才知道人有太多的烦恼事，哭笑钵真的能左右人的喜怒悲乐。它的心肠太软，见不得人落泪，有一次，一个姑娘求问观音，摔了哭笑钵，姑娘破涕为笑。而观音却直摇头，姑娘走后，观音就对哭笑钵说：你只是按自己的意愿去办事，你闯下大祸了。果真，很快传来姑娘被浸猪笼的消息。原来，姑娘问的是她想和男子私奔，行得通吗？哭笑钵私下答应了她。哭笑钵为此付出代价，它真的变不成人。还好，以它的道行，它即使变为石头，也是一块名贵的玉石。刚好有个玉匠避雨路过观音庙，在沾满蜘网的墙角，发现了这块混沌的红玉，欣喜若狂。玉匠的儿子当时正要参加科举，玉匠便用玉石给儿子雕了一块鲤鱼玉坠，取鲤鱼跃龙门之说。玉匠的儿子腰间戴着这枚玉坠参加科考，运气很好，过五关斩六将，终来到大殿经受皇上殿试。他的才思敏捷博得皇上的认可，由此钦点给了他头名。他叩首谢恩时，腰间那枚红鲤鱼玉坠晃了出来，正被偷偷躲在大殿玩的太子见到。太子还是一个顽童，却看上了这个玉坠，他便摘下玉坠送给了小太子。想不到小太子后来当了皇上，竟然还带着这块玉坠。这是一块灵玉啊。    朱二能逃出总兵府，必是这块灵玉所助。拜辞老者后，朱二方想起汤总兵已命人去拘捕朱大和香香，悔得肠子都青了，便火速赶回朱家。    朱家已人去楼空。    原来，赌坊大佬寻不到朱二，便到朱大处拘人，想不到香香一眼就认出，大佬乃是其父龙贵华，几个打手是戏班子的师兄。香香喜极而泣，撕下脸上的鱼膘胶，恢复容貌，把自己得朱大相救之事相告。龙贵华本来万念俱灰，他也耳闻了香香在河底失踪，便抱着一丝信念，和几个不愿散伙的戏班子成员四处打听，以赌为幌子，寻女儿是真。这时，怕朱二去报官坏事，众人赶在官府到达之前，已动身离开了堕州。    倒是朱二，痛改前非，洗心革面。腰挂鲤鱼坠，得此神助，几次三番，从汤总兵的库房内偷出大量的金银珠宝，通过池中暗道，运出总兵府，兑换成大米，送给受灾的堕州百姓解救饥荒。     "}
     */

    private int showapi_res_code;
    private String showapi_res_error;
    /**
     * allPages : 1
     * ret_code : 0
     * text :    堕州有一个戏班，盘踞在汝南。一直以来，班主龙贵华在闽中贵为芗戏王之称，只可惜闽戏遭到地方府衙的打压。后来，在堕州，就出现了挂名
     * 倪家玉的戏班，班主仍是龙贵华，走的路子不再是闽戏的秀外慧中，而是融入了堕州风情的地方戏种。
     * 龙贵华有个女儿，叫香香，眉心上方有粒红痣，与挂图中的观世音菩萨极其相似。因这个缘故，戏班子里逢有仙戏，观音的扮角定是香香。戏班子曾经在堕州总兵汤险安的府上演过一出戏，戏名叫
     * 《观音收童子》，这是在堕州一带流传甚广的传说。谢幕戏上，香香扮的观音踩上莲花座，莲花座悬空浮起，观音手扶绿柳瓶，目光和祥，座下莲花花瓣徐徐展开，祥光四射。童子穿红妆，扎小辫，腾着浮云也飘向空中，戏场烟雾弥漫。汤总兵的老母亲看了这出戏后，还耸在戏端下不来，她对汤险安说，那尊观音真神了，跟她梦里的观音菩萨一模一样。言下之意，是要汤险安多赏银子犒劳戏班子。不久，汤险安的母亲病逝，汤总兵在堕州西郊山陵造了座豪华陵墓。头七那天，汤险安请来了班主龙贵华，要戏班在西郊山陵其母坟前搭台唱戏。龙贵华很生气，他认为戏班子从没有在坟前为死人演过戏，戏是演给活人看的，演给死人看的那不叫阴戏了？    汤险安笑道：班主该改口了，这不叫阴戏，叫仙戏。龙贵华拂袖而去，不欢而散。    这算是与汤总兵结下了怨。    这一年，堕州一带一年没下半滴雨，农作物颗粒无收，百姓处在恐慌之中。当朝皇帝南下游玩正好路过此处，见百木枯零，田野荒废。    皇帝指着饥荒的堕州大地问汤总兵：这满目荒凉，让朕的心胆寒呀！    随行的一名叫达达苏的蕃僧，替汤险安开解，对皇帝说：贵国民间素有龙王显灵一说，今天下太平，惟独龙王不行云布雨，定是那龙王酣睡不醒，休眠在这波平浪静的堕州河。皇帝听了蕃僧的一席话，并不放在心上，汤险安却如捉住了救命稻草。    当晚，皇帝睡至半夜，迷迷糊糊听到有人在召唤他，便合衣坐了起来，他看见芸窗兀自开了，窗前飘来一朵祥云，祥云中立着个人，分明是一尊身穿白衣的观世音菩萨，手提杨柳枝，丹唇轻启：今堕州大旱，原因在这堕州黎民中，有个名叫香香的女子竟然假扮本座，时常扰乱龙王视听，龙王怪罪下来，禁闭了雨期。今本座手上有张图，便是香香姑娘，惟有用她举行祭雨仪式，方能开禁雨期，重降甘露！说完，把手上的卷图抛进窗内，祥云各自散去。皇帝伸手去捉，果然接住一个物件，这一捉，蓦地清醒，见拿在手上的却不是什么图，而是自己腰间的一个鲤鱼坠。    隔日，皇帝将这一梦境公布，向蕃僧讨个解释。蕃僧转过身对汤险安道：皇上此梦做得及时，不然，堕州百姓岌岌可危也。当下务必要依皇上梦境行事，用那个名叫香香的女子行祭雨仪式。随后蕃僧又对皇帝讲道：既然皇上的鲤鱼坠在梦境中变为香香姑娘的画图，请皇上把玉坠交与汤总兵，以用于祭雨仪式用！    皇帝头脑一发蒙，就解下腰间的一枚鲤鱼坠来，交于汤险安，嘱咐道：切不可劳命伤财！袖管一拂，便离开了堕州。    原来，汤险安用财宝贿赂蕃僧，让其作法，促使皇帝得梦，便是要治龙贵华的辞戏之祸。    汤险安立马派人去捉龙贵华的女儿香香。戏班子当时正在汝南集圩拆解戏棚，不料一队人马包围住了戏棚。    汤总兵喝道：皇上有旨，选用民间女子香香，行祭雨仪式。来人，把她给我捉走！    荒唐呀，荒唐！龙贵华拦在官兵面前。官兵一拥而上，把龙贵华推搡开来，捉走了香香。鬼故事大全：guidaye.com    戏班子的人看着班主的女儿被捉走，有一种树倒猢狲散的悲哀感，又逢这旱灾，人都吃不饱，谁还有心思看戏，便三三两两地卷起包裹逃命去了。龙贵华看着眼前这一切，昏死过去。    堕州河边，祭雨师开坛祭雨。官兵押解着将被献给堕河龙王的香香，香香胸前挂着那枚鲤鱼坠。    堕州百姓虽不满拿香香来行祭雨仪式，但一想到如若真能求来雨露，他们的良心就蔫了，全都木然地看着这场祭雨仪式。汤总兵让一队官兵排成一堵刀墙，以防止不良百姓搅了仪式。    祭雨师把几道符用桃木剑挑了，焚烧后便扬扬手。    随着官兵一推，香香沉入堕州河，水面上并未起波澜。    堕州河底，有一对朱家兄弟，正在水底潜水挖蚌。突见河面上沉下一物来，待兄弟俩看清，原来是一个好看的姑娘，身上绑一块巨大的雨花石。哥哥朱大赶紧用腰间的刀划开绑在石上的绳索，弟弟朱二在前引路，一前一后，在水底把姑娘偷偷给救出。    求雨仪式后，堕州并未见下半滴雨来。祭雨师被千夫所指，慌乱之下，祭雨师口口声声说：定是有人坏了求雨秘咒，供奉龙王的女子，必出了差错。于是汤总兵命人下河捞人，果然只寻到一块雨花石。    风声四起，百姓也跟着附合，都道：这下坏了，天谴了。    朱大听到了堕州�面上的诸多传闻，香香自然不能再在堕州出现，便用一种鱼膘做成的面胶，覆在香香的脸上。没过几天，那鱼膘胶就成了一张人皮膜，把香香的容貌改变了。    香香感于朱大朱二的救命之恩，因担心露面会害了朱大朱二及连累父亲龙贵华，便断了去意，安心住在朱家。不久，与朱大日久生情，便嫁与朱大。朱二表面上没说什么，内心却堵得慌，其实他也恋上了香香。朱二不久便搬离了朱家，且不再与朱大一起下河挖蚌捕鱼，各干各的，兄弟情分日渐生离。    这天，香香补鱼网，突然针扎到了拇指上，拇指渗出了血珠子。有一滴被香香无意中沾到了腰间挂的鲤鱼坠上。倾刻间，香香感到腰间晃动，似有什么东西在争个鱼死网破似的，忙伸手去摸腰间，手上却并无它物，只是腰间的鲤鱼坠热得烫手。    香香预感到出了事，一定是朱大。便赶紧跑去赌坊，喊出朱二。原来朱二搬离朱家后，便沉迷赌场。算朱二还有点良心，速去堕州河，在朱大平日下水的地方，潜入河中，果然见朱大沉在堕河底。    朱二费了九牛二虎之力，才把朱大拖上岸。幸好朱大练过闭气功，捡回一条命。    这天，赌坊来了一个大佬，赌技奇淫之术，练得是炉火纯青。坐镇赌坊后，横扫一片本地赌徒。朱二也着了大佬的道，与大佬赌了三盘后，朱二输光了家底，且欠了一大笔赌债。    大佬带了几个帮手，按住朱二，要朱二偿还赌债。朱二人穷志短，扑通跪地，求大佬宽限几日，几日之后，必有不义之财。    朱二出了赌坊，便潜入朱家，把香香藏挂在腰间的鲤鱼坠扯在手上，跑远了。鬼dàyé    朱大回来听说后，骂道：朱二怕是穷途末路，抢去典当了。香香却摇头道：若是去典当了还好，只怕去那恶贼的府上，告发你坏了官府的求雨！香香话一出口，朱大顿时愣在那里，赌棍什么事干不出来？香香说得没错，朱二出了门，便跑到了汤总兵的府上。看门的兵丁见朱二不像善种，拦住去路。    朱二说有天大的秘密献上。汤总兵传朱二进见：听说你有天大的秘密，普天之下，跟天有关的，除非圣上。你一个小小的平民百姓，能有多大的屁事！    大人，若小的讲出的秘密有价值，求大人赏小的一笔赏钱。    汤总兵点了下头，朱二便把朱大救走香香一事，添油加醋说了出来，只是略过了自己也参与其中。可怪的是，朱二找遍了身上，也不见鲤鱼坠踪影，好在汤总兵没让他拿出证物。    汤总兵并不信祭雨，只是为了报复龙贵华，看来他的女儿香香是被救了。    汤总兵一声令下：速去把朱大和香香。缉拿归案。众兵丁领命而去。朱二眼巴巴地等着赏钱，汤总兵却让兵丁把朱二轰出去。汤府内有一个大池子，水气氤氲，朱二多看了几眼，冷不防，背后被兵丁一推，掉入池子。兵丁只是嫌朱二走得慢，推了一把，想不到把朱二推入了池子。    朱二落水后，才知池子好深。怪的是，朱二被一股力量推往池底，池底有个暗道，朱二顺着暗道游去，没多久，游到了天方地阔的堕州河，原来暗道贯通堕州河和总兵府。水能聚财，汤总兵是听信了风水大师的话，才花大力气秘密挖通了此水道。    想不到这时，河面上漂着一条船，船上有个老者，正在钓鱼。朱二借机爬上船，老者见朱二腰间挂着玉坠，吃了一惊，伸手让朱二摘下。朱二也很奇怪，在总兵府上，苦寻不到玉坠，玉坠何以就一直戴在腰间呢？朱二解下玉坠，老者摸着这块玉坠道：这乃是圣上之物，为何在你手中？老者自称前朝国师，只因当今圣上偏信蕃僧蛊乱，这才远离朝都，漂泊于此。他知道这枚鲤鱼坠的出处，便讲予朱二：    很久以前，凡物若想要修练成人的样子，而又不想苦修上百年的话，有一个捷径可走，那就是到观音庙去，变成一对占卜哭笑钵，尽让人去摔打，换取功德。果真有这么一条鲤鱼，它来到观音面前，虔诚地央求观音把它的躯体变为哭笑钵。观音笑着对它讲，世间万物若想索取，必要赌风险，若你变不成人样，只能永生做一块石头，你甘愿吗？那红鲤没有意见，观音就真的把它变为一对哭笑钵。做了一对哭笑钵，由此它听遍了来参拜观音的人的话，才知道人有太多的烦恼事，哭笑钵真的能左右人的喜怒悲乐。它的心肠太软，见不得人落泪，有一次，一个姑娘求问观音，摔了哭笑钵，姑娘破涕为笑。而观音却直摇头，姑娘走后，观音就对哭笑钵说：你只是按自己的意愿去办事，你闯下大祸了。果真，很快传来姑娘被浸猪笼的消息。原来，姑娘问的是她想和男子私奔，行得通吗？哭笑钵私下答应了她。哭笑钵为此付出代价，它真的变不成人。还好，以它的道行，它即使变为石头，也是一块名贵的玉石。刚好有个玉匠避雨路过观音庙，在沾满蜘网的墙角，发现了这块混沌的红玉，欣喜若狂。玉匠的儿子当时正要参加科举，玉匠便用玉石给儿子雕了一块鲤鱼玉坠，取鲤鱼跃龙门之说。玉匠的儿子腰间戴着这枚玉坠参加科考，运气很好，过五关斩六将，终来到大殿经受皇上殿试。他的才思敏捷博得皇上的认可，由此钦点给了他头名。他叩首谢恩时，腰间那枚红鲤鱼玉坠晃了出来，正被偷偷躲在大殿玩的太子见到。太子还是一个顽童，却看上了这个玉坠，他便摘下玉坠送给了小太子。想不到小太子后来当了皇上，竟然还带着这块玉坠。这是一块灵玉啊。    朱二能逃出总兵府，必是这块灵玉所助。拜辞老者后，朱二方想起汤总兵已命人去拘捕朱大和香香，悔得肠子都青了，便火速赶回朱家。    朱家已人去楼空。    原来，赌坊大佬寻不到朱二，便到朱大处拘人，想不到香香一眼就认出，大佬乃是其父龙贵华，几个打手是戏班子的师兄。香香喜极而泣，撕下脸上的鱼膘胶，恢复容貌，把自己得朱大相救之事相告。龙贵华本来万念俱灰，他也耳闻了香香在河底失踪，便抱着一丝信念，和几个不愿散伙的戏班子成员四处打听，以赌为幌子，寻女儿是真。这时，怕朱二去报官坏事，众人赶在官府到达之前，已动身离开了堕州。    倒是朱二，痛改前非，洗心革面。腰挂鲤鱼坠，得此神助，几次三番，从汤总兵的库房内偷出大量的金银珠宝，通过池中暗道，运出总兵府，兑换成大米，送给受灾的堕州百姓解救饥荒。
     */

    private ShowapiResBodyBean showapi_res_body;

    public int getShowapi_res_code() {
        return showapi_res_code;
    }

    public void setShowapi_res_code(int showapi_res_code) {
        this.showapi_res_code = showapi_res_code;
    }

    public String getShowapi_res_error() {
        return showapi_res_error;
    }

    public void setShowapi_res_error(String showapi_res_error) {
        this.showapi_res_error = showapi_res_error;
    }

    public ShowapiResBodyBean getShowapi_res_body() {
        return showapi_res_body;
    }

    public void setShowapi_res_body(ShowapiResBodyBean showapi_res_body) {
        this.showapi_res_body = showapi_res_body;
    }

    public static class ShowapiResBodyBean {
        private String text;

        public String getText() {
            return text;
        }

        public void setText(String text) {
            this.text = text;
        }
    }
}
